org/ricing.org
#+TITLE: Ricing

Scattered notes on ricing.

