content/posts/ricing.md
+++
title = "Ricing wm and desktop configuration wm and desktop configuration"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T23:34:32-07:00
slug = "ricing"
draft = false
+++

Scattered notes on ricing.
